Repository: tcfshcrw/DIYFFBPedalPluginLocalization
Catalog: language/DiyActivePedal.*.resx
Languages: fr_fr, it, zh_cn, zh_tw

# DIYFFBPedalPlugin_BtnTextExponent
source: Exponent
fr_fr: Exponentielle
it: Lenta
zh_cn: 指数曲线
zh_tw: 指數

# DIYFFBPedalPlugin_BtnTextLinear
source: Linear
fr_fr: Linéaire
it: Lineare
zh_cn: 线性
zh_tw: 線性

# DIYFFBPedalPlugin_BtnTextLogarithm
source: Logarithm
fr_fr: Logarithmique
it: Veloce
zh_cn: 对数曲线
zh_tw: 對數

# DIYFFBPedalPlugin_BtnTextSCurve
source: S-Curve
fr_fr: Courbe en S
it: Curva a S
zh_cn: S曲线
zh_tw: S曲線

# DIYFFBPedalPlugin_ButtonTextGetOnlineConfig
source: Cloud Config
fr_fr: Configuration cloud
zh_cn: 云端设置
zh_tw: 線上設定檔

# DIYFFBPedalPlugin_ButtonTextGetPedalInfo
source: Pedal Info
fr_fr: Pedal Info → Infos pédale
it: Info pedale
zh_cn: 踏板信息
zh_tw: 獲得踏板信息

# DIYFFBPedalPlugin_ButtonTextPedalOta
source: OTA
zh_cn: OTA更新
zh_tw: OTA更新

# DIYFFBPedalPlugin_ButtonTextPedalRestart
source: Retsart
fr_fr: Redémarrer
it: Riavvia
zh_cn: 重启
zh_tw: 重啟踏板

# DIYFFBPedalPlugin_ButtonTextSerialMonitor
source: Serial Logs
fr_fr: Journaux série
it: Serial Log
zh_cn: 电机日志
zh_tw: 顯示log視窗

# DIYFFBPedalPlugin_ButtonTextWirelessAssignment
source: Pedal Roles
fr_fr: Rôles des pédales
it: Wifi
zh_cn: 无线踏板绑定
zh_tw: 踏板配置

# DIYFFBPedalPlugin_LabelDebugFlag0
source: Debug Flag 0:
fr_fr: Indicateur debug 0 :
it: Flag di debug 0:
zh_cn: 调试标识0:

# DIYFFBPedalPlugin_LabelPedalSetting
source: Pedal Settings
fr_fr: Paramètres pédale
it: Impostazioni pedale
zh_cn: 踏板设置
zh_tw: 踏板設定

# DIYFFBPedalPlugin_LabelSystemSettingAdvancedMode
source: Advanced Mode
fr_fr: Mode avancé
it: Modalità avanzata
zh_cn: 高级模式
zh_tw: 進階模式

# DIYFFBPedalPlugin_LabelSystemSettingAutoComConnect
source: Automatic Com Connect
fr_fr: Connexion COM automatique
it: Connessione automatica
zh_cn: 自动连接COM口

# DIYFFBPedalPlugin_LabelSystemSettingAutoConnectBridge
source: Automatic Bridge Connect
fr_fr: Connexion automatique du bridge
it: Connessione automatica bridge
zh_cn: 自动连接无线控制器
zh_tw: 自動連接橋接器

# DIYFFBPedalPlugin_LabelSystemSettingAutoProfileSwitch
source: Automatic Profile Switch
fr_fr: Changement de profil automatique
it: Cambio automatico profilo
zh_cn: 自动切换配置文件
zh_tw: 自動切換配置

# DIYFFBPedalPlugin_LabelSystemSettingFanatecOrPicoSupport
source: Fanatec Or Pico Support
fr_fr: Support Fanatec ou Pico
it: Supporto Fanatec o Pico
zh_cn: Fanatec或Pico支持

# DIYFFBPedalPlugin_LabelSystemSettingTittle
source: System Setting
fr_fr: Paramètres système
it: Impostazione sistema
zh_cn: 系统设置
zh_tw: 系統設定

# DIYFFBPedalPlugin_LabelSystemSettingVjoyOutput
source: vJoy Output
fr_fr: Sortie vJoy
it: Output vJoy
zh_cn: vJoy输出
zh_tw: 輸出至vJoy

# DIYFFBPedalPlugin_TabTextFilter
source: Filter
fr_fr: Filtre
it: Filtro
zh_cn: 过滤器
zh_tw: 濾波

# DIYFFBPedalPlugin_TabTextGeneral
source: General
fr_fr: Général
it: Generale
zh_cn: 通用
zh_tw: 一般

# DIYFFBPedalPlugin_TabTextGlobalEffects
source: Global Effects
fr_fr: Effets globaux
it: Effetti globali
zh_cn: 全局效果
zh_tw: 全域效果

# DIYFFBPedalPlugin_TabTextServo
source: Servo
fr_fr: Servomoteur
zh_cn: 伺服
zh_tw: 馬達

# DIYFFBPedalPlugin_TextApply
source: Apply
fr_fr: Appliquer
it: Applica
zh_cn: 应用
zh_tw: 應用

# DIYFFBPedalPlugin_TextAutoClear
source: Auto Clear
fr_fr: Effacement automatique
it: Cancellazione automatica
zh_cn: 自动清除
zh_tw: 自動清空

# DIYFFBPedalPlugin_TextAutomaticPedalConnect
source: Automatic Pedal Connect
fr_fr: Connexion automatique de la pédale
it: Connessione automatica
zh_cn: 自动连接踏板（有线）
zh_tw: 自動連線到踏板com port

# DIYFFBPedalPlugin_TextBridgeId
source: Bridge
zh_cn: 无线控制器
zh_tw: 橋接器

# DIYFFBPedalPlugin_TextBtnBind
source: Bind
fr_fr: Associer
it: Accoppiamento
zh_cn: 绑定
zh_tw: 綁定

# DIYFFBPedalPlugin_TextBtnBridgeDebug
source: Bridge Debug
fr_fr: Débogage du Bridge
zh_cn: 控制器调试
zh_tw: 橋接器排錯

# DIYFFBPedalPlugin_TextBtnBridgeOTA
source: Bridge OTA
fr_fr: OTA du bridge
zh_cn: 控制器OTA
zh_tw: 橋接器OTA

# DIYFFBPedalPlugin_TextBtnBridgeRestart
source: Restart
fr_fr: Redémarrage
it: Riavvia
zh_cn: 重启
zh_tw: 重啟橋接器

# DIYFFBPedalPlugin_TextBtnClear
source: Clear
fr_fr: Effacer
it: Pulisci
zh_cn: 清除
zh_tw: 清除

# DIYFFBPedalPlugin_TextBtnPluginUpdate
source: Plugin Update
fr_fr: Mise à jour du plugin
it: Aggiornamento plugin
zh_cn: 插件更新
zh_tw: Plugin更新

# DIYFFBPedalPlugin_TextConfigListAddNewConfig
source: Add new Config
fr_fr: Ajouter une configuration
it: Aggiungi nuova config
zh_cn: 新增设置文件
zh_tw: 新增踏板設定檔

# DIYFFBPedalPlugin_TextConfigListPreview
source: Preview
fr_fr: Aperçu
it: Anteprima
zh_cn: 预览
zh_tw: 預覽

# DIYFFBPedalPlugin_TextConfigListReset
source: Reset Active Config
fr_fr: Réinitialiser la configuration active
it: Ripristina config
zh_cn: 重置激活的配置
zh_tw: 重製現在的設定檔

# DIYFFBPedalPlugin_TextConfigListSaveAs
source: Save as New Config
fr_fr: Enregistrer comme nouvelle configuration
it: Salva nuova config
zh_cn: 另存为新设置文件
zh_tw: 儲存為新的設定檔

# DIYFFBPedalPlugin_TextConfigListSetAsStartup
source: Set as Startup
fr_fr: Définir comme démarrage
it: Imposta come Predefinito
zh_cn: 设置为默认启动配置
zh_tw: 設為啟動設定

# DIYFFBPedalPlugin_TextConfigListTittle
source: Config List
fr_fr: Liste de configuration
it: Elenco configurazioni
zh_cn: 配置文件清单
zh_tw: 設定檔清單

# DIYFFBPedalPlugin_TextDelete
source: Delete
fr_fr: Supprimer
it: Cancella
zh_cn: 删除
zh_tw: 刪除

# DIYFFBPedalPlugin_TextEffectABSEffectApply
source: Effect Apply By:
fr_fr: Application de l’effet :
it: Effetto applicato
zh_cn: 效果应用于：
zh_tw: 效果計算依據

# DIYFFBPedalPlugin_TextEffectABSEffectProfile
source: Effect Profile:
fr_fr: Profil de l’effet
it: Profilo effetti:
zh_cn: 效果配置：
zh_tw: 效果波形

# DIYFFBPedalPlugin_TextEffectABSSimulateABS
source: Simulate ABS
fr_fr: Simuler l'ABS
it: Simula l'ABS
zh_cn: 模拟ABS
zh_tw: 模擬ABS

# DIYFFBPedalPlugin_TextEffectABSSliderAmp
source: ABS/TC Amplitude
fr_fr: Amplitude ABS/TC
it: Ampiezza ABS/TC
zh_cn: ABS/TC振幅
zh_tw: ABS/TC 振幅

# DIYFFBPedalPlugin_TextEffectABSSliderFreq
source: ABS/TC Frequency
fr_fr: Fréquence ABS/TC
it: Frequenza ABS/TC
zh_cn: ABS/TC频率
zh_tw: ABS/TC 振動頻率

# DIYFFBPedalPlugin_TextEffectABSTestABS
source: Test ABS/TC
fr_fr: Tester ABS/TC
it: Test ABS
zh_cn: 测试ABS/TC
zh_tw: 測試ABS/TC

# DIYFFBPedalPlugin_TextEffectABSTittle
source: ABS/TC Effect
fr_fr: Effet ABS/TC
it: Effetto ABS/TC
zh_cn: ABS/TC效果
zh_tw: ABS/TC效果

# DIYFFBPedalPlugin_TextEffectBiteAmp
source: Bite Point Amplitude
fr_fr: Amplitude du point de mordant
it: Ampiezza Bite Point
zh_cn: 结合点振幅
zh_tw: 咬合點效果振幅

# DIYFFBPedalPlugin_TextEffectBiteFreq
source: Bite Point Frequency
fr_fr: Fréquence du point de mordant
it: Frequenza Bite Point
zh_cn: 结合点状频率
zh_tw: 咬合點效果頻率

# DIYFFBPedalPlugin_TextEffectBiteTittle
source: Bite Point Vibration
fr_fr: Vibration du point de mordant
it: Vibrazione Bite Point
zh_cn: 离合结合点振动
zh_tw: 咬合點振動

# DIYFFBPedalPlugin_TextEffectCustom1Tittle
source: Custom Effect 1
fr_fr: Effet personnalisé 1
it: Effetto personalizzato 1
zh_cn: 自定义效果1
zh_tw: 自定義效果1

# DIYFFBPedalPlugin_TextEffectCustom2Tittle
source: Custom Effect 2
fr_fr: Effet personnalisé 2
it: Effetto personalizzato 2
zh_cn: 自定义效果2
zh_tw: 自定義效果2

# DIYFFBPedalPlugin_TextEffectCustomAmp
source: Effect Amplitude
fr_fr: Amplitude de l'effet
it: Ampiezza dell'effetto
zh_cn: 效果振幅
zh_tw: 效果振福

# DIYFFBPedalPlugin_TextEffectCustomFreq
source: Effect Frequency
fr_fr: Fréquence de l’effet
it: Frequenza dell'effetto
zh_cn: 效果频率
zh_tw: 效果頻率

# DIYFFBPedalPlugin_TextEffectCustomTrigger
source: Effect Trigger
fr_fr: Déclencheur de l’effet
zh_cn: 效果触发器
zh_tw: 效果閥值

# DIYFFBPedalPlugin_TextEffectEngineAmp
source: Effect Amplitude
fr_fr: Amplitude de l'effet
it: Ampiezza dell'effetto
zh_cn: 效果振幅
zh_tw: 效果振福

# DIYFFBPedalPlugin_TextEffectEngineDepend
source: Effect depend:
fr_fr: Dépendance de l’effet :
zh_cn: 效果依赖：
zh_tw: 效果計算依據

# DIYFFBPedalPlugin_TextEffectEngineFreq
source: Effect Frequency:
fr_fr: Fréquence de l’effet :
it: Frequenza dell'effetto:
zh_cn: 效果频率：
zh_tw: 效果頻率

# DIYFFBPedalPlugin_TextEffectEngineRPM
source: Engine RPM
fr_fr: Régime moteur (RPM)
it: Giri del motore
zh_cn: 发动机转速
zh_tw: 引擎振動

# DIYFFBPedalPlugin_TextEffectEngineSpeed
source: Speed Rumble
fr_fr: Vibrations de vitesse
zh_cn: 速度振动
zh_tw: 速度振動

# DIYFFBPedalPlugin_TextEffectEngineTittle
source: Engine RPM / Speed Rumble Effect
fr_fr: RPM moteur / vibrations de vitesse
zh_cn: 发动机转速/速度振动效果
zh_tw: 引擎/速度振動效果

# DIYFFBPedalPlugin_TextEffectGforceMultiplier
source: G Force Multiplier
fr_fr: Multiplicateur de force G
it: Moltiplicatore della forza G
zh_cn: G力
zh_tw: G力疊加比

# DIYFFBPedalPlugin_TextEffectGforceSmoothness
source: G Force Smoothness
fr_fr: Lissage de la force G
it: Smoothness forza G
zh_cn: G力平滑度
zh_tw: G力順滑度

# DIYFFBPedalPlugin_TextEffectGforceTittle
source: G-Force Effect
fr_fr: Effet G-Force
it: Effetto Forza G
zh_cn: G力效果
zh_tw: G力效果

# DIYFFBPedalPlugin_TextEffectImpactMultiplier
source: Impact Multiplier
fr_fr: Multiplicateur d'impact
it: Moltiplicatore impatto
zh_cn: 道路冲击
zh_tw: 衝擊疊加比

# DIYFFBPedalPlugin_TextEffectImpactSmoothness
source: Impact Smoothness
fr_fr: Lissage de l’impact
zh_cn: 道路冲击平滑器
zh_tw: 衝擊順滑度

# DIYFFBPedalPlugin_TextEffectImpactTittle
source: Road Impact Effect
fr_fr: Effet d’impact de la route
zh_cn: 道路冲击效果
zh_tw: 路面衝擊效果

# DIYFFBPedalPlugin_TextEffectRudderAccTittle
source: Acceleration Effect
fr_fr: Effet d'accélération
it: Effetto accelerazione
zh_cn: 加速效果
zh_tw: 加速度效果

# DIYFFBPedalPlugin_TextEffectRudderAccWindForce
source: Wind Force Applied on Rudder
fr_fr: Force du vent appliquée sur le gouvernail
it: Forza del vento applicata al timone
zh_cn: 舵面风力
zh_tw: 計算腳舵風力

# DIYFFBPedalPlugin_TextEffectRudderEngineTittle
source: Engine RPM Rumble Effect
fr_fr: Effet de vibration du régime moteur
zh_cn: 发动机转速振动效果
zh_tw: 引擎震動效果

# DIYFFBPedalPlugin_TextEffectUpdateRate
source: Effects Update Rate:
fr_fr: Taux de mise à jour des effets :
it: Frequenza aggiornamento effetti:
zh_cn: 效果更新频率：
zh_tw: 踏板效果更新率:

# DIYFFBPedalPlugin_TextEffectWheelSlipAmp
source: Notification Amplitude
fr_fr: Amplitude de notification
it: Ampiezza delle notifiche
zh_cn: 通知振幅
zh_tw: 提醒振幅

# DIYFFBPedalPlugin_TextEffectWheelSlipFreq
source: Notification Frequency
fr_fr: Fréquence de notification
it: Frequenza di notifica
zh_cn: 通知频率
zh_tw: 提醒頻率

# DIYFFBPedalPlugin_TextEffectWheelSlipProperty
source: Effect Property
fr_fr: Propriété de l’effet
it: Proprietà dell'effetto
zh_cn: 效果属性
zh_tw: 效果property

# DIYFFBPedalPlugin_TextEffectWheelSlipTittle
source: Wheel Slip Notification
fr_fr: Notification de patinage des roues
it: Notifica di slittamento delle ruote
zh_cn: 轮胎打滑通知
zh_tw: 打滑通知

# DIYFFBPedalPlugin_TextEffectWheelSlipTrigger
source: Notification Trigger
fr_fr: Déclencheur de notification
zh_cn: 打滑效果触发器
zh_tw: 通知閥值

# DIYFFBPedalPlugin_TextForceCurveAdjustment
source: FORCE CURVE ADJUSTMENT
fr_fr: AJUSTEMENT DE LA COURBE DE FORCE
it: REGOLAZIONE DELLA CURVA DELLA FORZA
zh_cn: 力曲线调整
zh_tw: 力量曲線調整

# DIYFFBPedalPlugin_TextForceTravelCurve
source: FORCE-TRAVEL CURVE
fr_fr: COURBE FORCE–DÉBATTEMENT
it: CURVA FORZA-PERCORSO
zh_cn: 力行程曲线
zh_tw: 力量-位移曲線

# DIYFFBPedalPlugin_TextGeneralSetting
source: General Settings
fr_fr: Paramètres généraux
it: Impostazioni generali
zh_cn: 通用设置
zh_tw: 一般設定

# DIYFFBPedalPlugin_TextGeneralSettingCrashDetect
source: Enable crash detect.
fr_fr: Activez la détection de crash.
it: Abilita rilevamento crash.
zh_cn: 启用碰撞检测
zh_tw: 崩潰保護

# DIYFFBPedalPlugin_TextGeneralSettingDampingFactor
source: Damping Factor
fr_fr: Facteur d'amortissement
it: Damping
zh_cn: 阻尼因子
zh_tw: 阻尼因子

# DIYFFBPedalPlugin_TextGeneralSettingJoystickOutputFromTravel
source: Joystick output from travel
fr_fr: Sortie joystick depuis le débattement
zh_cn: 摇杆行程输出
zh_tw: 以位移作為搖桿輸出

# DIYFFBPedalPlugin_TextGeneralSettingLinearPitch
source: Linear Module Pitch:
fr_fr: Pas du module linéaire :
it: Passo modulo lineare:
zh_cn: 丝杆导程
zh_tw: 線性模組Pitch

# DIYFFBPedalPlugin_TextGeneralSettingLoadcellRate
source: Loadcell Rate
fr_fr: Taux de la cellule de charge
it: KG cella di carico
zh_cn: 压力传感器数据
zh_tw: 感測器標稱

# DIYFFBPedalPlugin_TextGeneralSettingMaxGameOut
source: Max Game Output
fr_fr: Sortie maximale du jeu
it: Uscita di gioco massima
zh_cn: 游戏最大力反馈输出：
zh_tw: 最大搖桿輸出

# DIYFFBPedalPlugin_TextGeneralSettingReverseLCReading
source: Reverse LC reading
fr_fr: Inverser la lecture de la cellule de charge
it: Lettura LC inversa
zh_cn: 压传数据反向
zh_tw: 感測器讀數反向

# DIYFFBPedalPlugin_TextGeneralSettingReverseServoDirection
source: Reverse Servo Direction
fr_fr: Inverser la direction du servo
it: Inverti direzione servo
zh_cn: 伺服方向反向
zh_tw: 馬達反向

# DIYFFBPedalPlugin_TextGeneralSettingServoIdleTimeout
source: Servo Idle Timeout
fr_fr: Délai d'inactivité du servo
it: Timeout inattività del servo
zh_cn: 伺服空闲超时
zh_tw: 馬達不作用保護時間

# DIYFFBPedalPlugin_TextGeneralSettingStepLossRecor
source: Enable step loss recov.
fr_fr: Activer la récupération de perte de pas.
it: Recupero Perdita Passi
zh_cn: 启用步长损失恢复。
zh_tw: 背隙補償

# DIYFFBPedalPlugin_TextGlobalEffectsSettingSliderEffectThresholdForce
source: Threshold Force for Effect
fr_fr: Seuil de force pour l’effet
zh_cn: 效果阈值力
zh_tw: 效果最低踩踏力

# DIYFFBPedalPlugin_TextGlobalEffectsSettingTittle
source: Global Effects Setting
fr_fr: Paramètre des effets globaux
it: Impostazione degli effetti globali
zh_cn: 全局特效设置
zh_tw: 效果全域設定

# DIYFFBPedalPlugin_TextJoystickMapping
source: JOYSTICK MAPPING
fr_fr: CARTOGRAPHIE DU JOYSTICK
it: MAPPATURA JOYSTICK
zh_cn: 摇杆映射
zh_tw: 搖桿映射

# DIYFFBPedalPlugin_TextJoystickMappingArrangeInExponential
source: Arrange in Exponential
fr_fr: Disposition exponentielle
it: Disporre in esponenziale
zh_cn: 按指数排列
zh_tw: 以指數排列

# DIYFFBPedalPlugin_TextJoystickMappingArrangeInLine
source: Arrange in Line
fr_fr: Disposition linéaire
it: Disporre in linea
zh_cn: 按线性排列
zh_tw: 以線性排列

# DIYFFBPedalPlugin_TextJoystickMappingArrangeInLogarithm
source: Arrange in Logarithm
fr_fr: Disposition logarithmique
it: Disporre in logaritmo
zh_cn: 按对数排列
zh_tw: 以對數排列

# DIYFFBPedalPlugin_TextJoystickMappingArrangeInSCurve
source: Arrange in S Curve
fr_fr: Disposition en courbe S
it: Disporre in curva a S
zh_cn: 按s型排列
zh_tw: 以S曲線排列

# DIYFFBPedalPlugin_TextJoystickMappingTittle
source: JOYSTICK MAPPING
fr_fr: CARTOGRAPHIE DU JOYSTICK
it: MAPPATURA JOYSTICK
zh_cn: 摇杆映射
zh_tw: 搖桿映射

# DIYFFBPedalPlugin_TextKFSettingFilterModel
source: Filter Model:
fr_fr: Modèle de filtre :
it: Modello:
zh_cn: 过滤模式：
zh_tw: 濾波模型:

# DIYFFBPedalPlugin_TextKFSettingJoystickDenoiseSliderName
source: KF for Joystick Denoise
fr_fr: KF pour le débruitage du joystick
it: KF Joystick Denoise
zh_cn: 摇杆去噪KF值
zh_tw: 搖桿濾波KF

# DIYFFBPedalPlugin_TextKFSettingJoystickDenoiseToggle
source: Denoise for Joystick output
fr_fr: Débruitage de la sortie joystick
it: Denoise uscita joystick
zh_cn: 摇杆输出降噪
zh_tw: 搖桿濾波

# DIYFFBPedalPlugin_TextKFSettingKFDescription
source: Loadcell Denoising Factor (slow to fast)
fr_fr: Facteur de débruitage de la cellule de charge (lent à rapide)
it: denoising cella di carico (da lento a veloce)
zh_cn: 压力传感器去噪因子(慢到快)
zh_tw: 感測器濾波KF(慢到快)

# DIYFFBPedalPlugin_TextKFSettingTittle
source: Noise Reduction Filter
fr_fr: Filtre de réduction du bruit
it: Filtro riduzione rumore
zh_cn: 降噪滤波器
zh_tw: 降造濾波設定

# DIYFFBPedalPlugin_TextLabelBridgeVersion
source: Bridge Version
fr_fr: Version du bridge
zh_cn: 无线控制器版本
zh_tw: 橋接器版本

# DIYFFBPedalPlugin_TextLabelConnection
source: Connection
fr_fr: Connexion
it: Connessione
zh_cn: 连接状态
zh_tw: 連線狀態

# DIYFFBPedalPlugin_TextLabelDAPVersion
source: DAP Version
fr_fr: Version DAP
it: Versione DAP
zh_cn: 软件版本
zh_tw: DAP版本

# DIYFFBPedalPlugin_TextLabelPedalVersion
source: Pedal Version
fr_fr: Version de la pédale
it: Versione pedale:
zh_cn: 踏板软件版本
zh_tw: 踏板版本

# DIYFFBPedalPlugin_TextLabelPluginVersion
source: Plugin Version
fr_fr: Version du plug-in
it: Versione plugin:
zh_cn: 插件软件版本
zh_tw: Plugin版本

# DIYFFBPedalPlugin_TextLabelServoState
source: Servo State
fr_fr: État du servo
it: Stato del servo
zh_cn: 伺服状态
zh_tw: 馬達狀態

# DIYFFBPedalPlugin_TextLeaveWithoutChange
source: Leave without Change
fr_fr: Quitter sans enregistrer
it: Esci senza cambiamenti
zh_cn: 退出不保存
zh_tw: 離開且不儲存

# DIYFFBPedalPlugin_TextLogPedalStates
source: Log Pedal States
fr_fr: Journal des états de la pédale
zh_cn: 记录踏板状态
zh_tw: 紀錄踏板詳細數據

# DIYFFBPedalPlugin_TextOverloadWarning1
source: Caution, the config and pedal kinematics may cause servo overloaded!!
fr_fr: Attention, la config et la cinématique du pédalier peuvent provoquer une surcharge des servos !!
it: Attenzione, la configurazione e la cinematica del pedale possono causare un sovraccarico del servo!!
zh_cn: 注意，不当配置和踏板运动学数据可能导致伺服过载！！
zh_tw: 注意, 此設定檔會造成馬達過載

# DIYFFBPedalPlugin_TextOverloadWarning2
source: Max servo output force
fr_fr: Force de sortie maximale du servo
it: Forza massima di uscita del servo
zh_cn: 最大伺服出力
zh_tw: 最大馬達力量輸出

# DIYFFBPedalPlugin_TextOverwrite
source: Overwrite
fr_fr: Écraser
it: Sovrascrivi
zh_cn: 覆盖
zh_tw: 覆寫

# DIYFFBPedalPlugin_TextPedalIdBrake
source: Brake
fr_fr: Frein
it: Freno
zh_cn: 刹车
zh_tw: 剎車

# DIYFFBPedalPlugin_TextPedalIdClutch
source: Clutch
fr_fr: Embrayage
it: Frizione
zh_cn: 离合器
zh_tw: 離合

# DIYFFBPedalPlugin_TextPedalIdThrottle
source: Throttle
fr_fr: Accélérateur
it: Acceleratore
zh_cn: 油门
zh_tw: 油門

# DIYFFBPedalPlugin_TextPedalInfoTitle
source: Pedal Info
fr_fr: Infos pédale
it: Informazioni sul pedale
zh_cn: 踏板信息
zh_tw: 踏板資訊

# DIYFFBPedalPlugin_TextPedalKinematics
source: PEDAL KINEMATICS
fr_fr: CINÉMATIQUE DE LA PÉDALE
it: CINEMATICA DEL PEDALE
zh_cn: 踏板运动学
zh_tw: 踏板幾何

# DIYFFBPedalPlugin_TextPedalKinematicsError
source: Pedal Kinematic calculation error
fr_fr: Erreur de calcul de la cinématique de la pédale
it: Errore di calcolo cinematico del pedale
zh_cn: 踏板运动鞋计算错误
zh_tw: 踏板幾何計算錯誤

# DIYFFBPedalPlugin_TextPedalKinematicsExpectedMaxForce
source: Expected max force at max travel
fr_fr: Force maximale attendue au débattement maximal
it: Forza massima prevista alla corsa massima
zh_cn: 最大行程时预测的极限力
zh_tw: 最大行程時最大力量輸出

# DIYFFBPedalPlugin_TextPedalKinematicsTitle
source: PEDAL KINEMATIC SETTING
fr_fr: PARAMÈTRES DE CINÉMATIQUE DE LA PÉDALE
it: CINEMATICA PEDALE
zh_cn: 踏板运动学设置
zh_tw: 踏板幾何設定

# DIYFFBPedalPlugin_TextPedals
source: PEDALS
fr_fr: PÉDALES
it: PEDALI
zh_cn: 赛车踏板
zh_tw: 踏板

# DIYFFBPedalPlugin_TextProfileListAddNewProfile
source: Add new Profile
fr_fr: Ajouter un nouveau profil
it: Aggiungi nuovo profilo
zh_cn: 新增配置文件
zh_tw: 新增新的配置

# DIYFFBPedalPlugin_TextProfileListGameOrCar
source: Game or Car ID:
fr_fr: ID de jeu ou de voiture :
it: ID gioco o auto:
zh_cn: 游戏或车辆ID：
zh_tw: 遊戲或是車輛ID

# DIYFFBPedalPlugin_TextProfileListSaveAs
source: Save as New Profile
fr_fr: Enregistrer comme nouveau profil
it: Salva come nuovo profilo
zh_cn: 另存为新的配置文件
zh_tw: 儲存為新的配置

# DIYFFBPedalPlugin_TextProfileListTittle
source: Profile List
fr_fr: Liste des profils
it: Elenco profili
zh_cn: 配置文件列表
zh_tw: 配置清單

# DIYFFBPedalPlugin_TextProfileShortcutBinding
source: Profile Binding
fr_fr: Association de profil
it: Accoppiamento Profilo
zh_cn: 配置文件绑定
zh_tw: 配置綁定

# DIYFFBPedalPlugin_TextProfileShortcutName
source: Custom Action Name
fr_fr: Nom de l'action personnalisée
zh_cn: 自定义动作名称
zh_tw: 自定義動作名稱

# DIYFFBPedalPlugin_TextProfileShortcutTittle
source: Profile Shortcut
fr_fr: Raccourci de profil
it: Scorciatoia del profilo
zh_cn: 配置文件快照
zh_tw: 配置快捷切換

# DIYFFBPedalPlugin_TextProfileShortcutWarning
source: *The change of Custom Action Name will be applied after a simhub restart.
fr_fr: *La modification du nom de l’action personnalisée sera appliquée après un redémarrage de SimHub.
zh_cn: 自定义动作名称将在simhub重启后生效。
zh_tw: *動作名稱改變須重啟simhub

# DIYFFBPedalPlugin_TextRead
source: Read
fr_fr: Lire
it: Leggere
zh_cn: 读取
zh_tw: 讀取

# DIYFFBPedalPlugin_TextRefreshList
source: Refresh List
fr_fr: Actualiser la liste
it: Aggiorna elenco
zh_cn: 刷新列表
zh_tw: 重新整理

# DIYFFBPedalPlugin_TextRename
source: Rename
fr_fr: Renommer
it: Rinominare
zh_cn: 重命名
zh_tw: 重新命名

# DIYFFBPedalPlugin_TextRudder
source: RUDDER
fr_fr: GOUVERNAIL
it: TIMONE
zh_cn: 飞行脚舵
zh_tw: 腳舵

# DIYFFBPedalPlugin_TextRudderId
source: Rudder
fr_fr: Gouvernail
it: Timone
zh_cn: 飞行脚舵
zh_tw: 腳舵

# DIYFFBPedalPlugin_TextRudderInfoTitle
source: Rudder Info
fr_fr: Informations du gouvernail
it: Informazioni sul timone
zh_cn: 飞行脚舵信息
zh_tw: 腳舵資訊

# DIYFFBPedalPlugin_TextServoSettingSliderEndstopCurrent
source: Endstop Detection Threshold
fr_fr: Seuil de détection de fin de course
it: Soglia di rilevamento dei finecorsa
zh_cn: 限位检测阈值
zh_tw: 端點檢測電流閥值

# DIYFFBPedalPlugin_TextServoSettingSliderServoInertia
source: Ratio of Inertia (Pr0.04)
fr_fr: Rapport d'inertie (Pr0.04)
it: Inertia (Pr0.04)
zh_cn: 惯性比（pr0.04）
zh_tw: 慣量(Pr0.04)

# DIYFFBPedalPlugin_TextServoSettingSliderServoSmoothness
source: Servo position smoothing factor (Pr2.22)
fr_fr: Facteur de lissage de la position du servo (Pr2.22)
it: Smoothing posizione del servo (Pr2.22)
zh_cn: 伺服位置平滑因子（pr2.22）
zh_tw: 馬達平滑度設定(Pr2.22)

# DIYFFBPedalPlugin_TextServoSettingTittle
source: Servo Settings
fr_fr: Paramètres du servo
it: Impostazioni del servo
zh_cn: 伺服设置
zh_tw: 馬達設定

# DIYFFBPedalPlugin_TextSystem
source: SYSTEM
fr_fr: SYSTÈME
it: SISTEMA
zh_cn: 系统
zh_tw: 系統

# DIYFFBPedalPlugin_TextSystemInfoTitle
source: System Info
fr_fr: Informations système
it: Informazioni sul sistema
zh_cn: 系统信息
zh_tw: 系統資訊

# DIYFFBPedalPlugin_TextUpdateChannel
source: Update Channel:
fr_fr: Canal de mise à jour :
it: Aggiorna canale:
zh_cn: 更新频道：
zh_tw: 更新頻道

# DIYFFBPedalPlugin_TextUpdateForceFlash
source: Force Flash Firmware
fr_fr: Forcer le flash du firmware
it: Forza il firmware Flash
zh_cn: 强制刷写固件
zh_tw: 強迫寫入更新

# DIYFFBPedalPlugin_TextUpdateFromPlatformio
source: Upload from PlatformIO
fr_fr: Télécharger depuis PlatformIO
it: Carica da PlatformIO
zh_cn: 从PlatformIO更新
zh_tw: 從PlatformIo更新

# DIYFFBPedalPlugin_TextUpdateTestBuildWarning
source: Test Build DO NOT USE
fr_fr: Version de test — NE PAS UTILISER
it: Compilazione di prova NON UTILIZZARE
zh_cn: 测试创建，请勿使用
zh_tw: 測試頻道勿使用

# DIYFFBPedalPlugin_TextUpdateWindowPass
source: PASS:
fr_fr: MOT DE PASSE :
zh_cn: 密码：
zh_tw: 密碼:

# DIYFFBPedalPlugin_TextUpdateWindowSSID
source: SSID:
fr_fr: Nom du réseau (SSID)
zh_cn: wifi名称：
zh_tw: WIFI名稱

# DIYFFBPedalPlugin_TextUpdateWindowTitle
source: Update Setting
fr_fr: Paramètres de mise à jour
it: Aggiorna impostazione
zh_cn: 更新设置
zh_tw: 更新設定

# DIYFFBPedalPlugin_TextWirelessCommunication
source: Wireless Communication
fr_fr: Communication sans fil
it: Modalità Wifi
zh_cn: 无线通讯
zh_tw: 啟用無線連接
